GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/mc8332.c
/*
   SIM卡的IMSI号码为4600 00783208249，
      460 00 18 23 20 86 42

   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t pt_resp_CIMI( char *p, uint16_t len )
{
	char *pimsi, i;

	rt_kprintf( "cimi len=%d\n", len );
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CGSN**/
rt_err_t pt_resp_CGSN( char *p, uint16_t len )
{
	char	*pimsi, i;
	char	*pstr;
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CPIN*/
rt_err_t pt_resp_CPIN( char *p, uint16_t len )
{
	char *pstr = RT_NULL;
	pstr = strstr( p, "+CPIN: READY" ); //+CPIN: READY
	if( pstr )
	{
		return RT_EOK;                  /*找到了*/
	}
	return RT_ERROR;
}

/* +CSQ: 31, 99 */
/*M66 +CSQ: 13,99*/
/*    +CSQ: 15,99*/

rt_err_t pt_resp_CSQ( char *p, uint16_t len )
{
	char		*pstr;
	uint32_t	i, n = 0, ber = 0;

	pstr = strstr( p, "+CSQ" );
	if( pstr == (char*)0 )
	{
		return RT_ERROR;
	}
	i = sscanf( pstr, "%*[^ ] %d,%d", &n, &ber );
	if( i != 2 )
	{
		return RT_ERROR;
	}
	if( n == 99 )
	{
		return RT_ERROR;
	}
	gsm_csq = n;
	if( n < 16 )
	{
		return RT_ERROR;
	}
	return RT_EOK;
}

/*+CGATT:1*/
rt_err_t pt_resp_CGATT( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "+CGATT: 1" );
	if( pfind )
	{
		return RT_EOK;
	}
	return RT_ERROR;
}

/*%ETCPIP:1,"10.24.44.142","0.0.0.0","0.0.0.0"*/
rt_err_t pt_resp_ETCPIP( char *p, uint16_t len )
{
	rt_err_t	res		= RT_ERROR;
	uint8_t		stage	= 0;
	char		*psrc	= p;
	char		*pdst	= gsm_param.ip;

	while( 1 )
	{
		if( stage == 0 )
		{
			if( *psrc == '"' )
			{
				stage = 1;
			}
			psrc++;
		}else
		{
			if( *psrc == '"' )
			{
				break;
			}
			*pdst = *psrc;
			pdst++;
			psrc++;
		}
	}
	rt_kprintf( "ip=%s\r\n", gsm_param.ip );
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t pt_resp_IPOPENX( char *p, uint16_t len )
{
	extern uint32_t gprs_ok_past_sec;

	if( strstr( p, "CONNECT" ) != RT_NULL )
	{
		gprs_ok_past_sec	= rt_tick_get( ) / 100;
		test_flag			|= TEST_BIT_GPRS;
		rt_kprintf( "\r\ntest_flag=%x", test_flag );
		return RT_EOK;
	}
	return RT_ERROR;
}

/*
 +CGMR: S/W VER: MC8332_MM8A8016  ZTEMT Team
 OK
 */
rt_err_t pt_resp_CGMR( char *p, uint16_t len )
{
	extern char gsm_ver[8];
	char		*pdst = RT_NULL;

	pdst = strstr( p, "MM8" );
	if( pdst != RT_NULL )
	{
		strncpy( gsm_ver, pdst + 5, 3 );
		return RT_EOK;
	}
	return RT_ERROR;
}

/*通用检查函数，看是否收到数据，如果有数据后再判断*/
rt_err_t pt_resp( RESP_FUNC func )
{
	char		*pstr;
	uint16_t	len;
	rt_err_t	ret;
	ret = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pstr, 0 );
	if( ret == -RT_ETIMEOUT )
	{
		return RT_ETIMEOUT;
	}
/*有应答，执行相应的函数*/
	len = ( ( *pstr ) << 8 ) | ( *( pstr + 1 ) );
	ret = func( pstr + 2, len );
	//rt_kprintf( "pt_resp ret=%x\r\n", ret );
	rt_free( pstr );
	return ret;
}

typedef rt_err_t ( *AT_RESP )( char *p, uint16_t len );
typedef struct
{
	char		*atcmd;
	AT_RESP		resp;
	uint16_t	timeout;
	uint16_t	retry;
}AT_CMD_RESP;

/*gsm供电的处理纤程*/

#ifdef MC8332


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static int protothread_gsm_power( struct pt *pt )
{
	static AT_CMD_RESP at_init[] =
	{
		{ RT_NULL,									  pt_resp_ZIND,		  RT_TICK_PER_SECOND * 10, 1  },
		{ "AT\r",									  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 10, 1  },
		{ "ATE0\r",									  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 5,  1  },
		{ "ATV1\r",									  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 5,  1  },
		{ "AT+CSQ?\r",								  pt_resp_CSQ,		  RT_TICK_PER_SECOND * 5,  10 },

		{ "AT+CPIN?\r",								  pt_resp_CPIN,		  RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+CREG?\r",								  pt_resp_CGREG,	  RT_TICK_PER_SECOND * 3,  20 },
		{ "AT+SPEAKER=1\r",							  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 5,  1  },
		{ "AT+VGR=0\r",								  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 5,  1  },
		{ "AT+ZTTS=2,\"C4FECFC4BFAACABCB2E2CAD4\"\r", pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 20, 1  },

		{ "AT+CIMI\r",								  pt_resp_CIMI,		  RT_TICK_PER_SECOND * 3,  1  },
		{ "AT+CGMR\r",								  pt_resp_CGMR,		  RT_TICK_PER_SECOND * 3,  3  },

		{ "AT+ZPNUM=#777\r",						  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 20, 1  },
		{ "AT+ZPIDPWD=card,card\r",					  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 20, 1  },
		{ "AT+ZPPPOPEN\r",							  pt_resp_STR_OK,	  RT_TICK_PER_SECOND * 20, 1  },
		{ RT_NULL,									  pt_resp_ZPPPSTATUS, RT_TICK_PER_SECOND * 40, 1  },
		{ "AT+ZIPSETUP=0,60.28.50.210,9131\r",		  pt_resp_ZTCPESTABLISHED,	  RT_TICK_PER_SECOND * 30, 1  },
	};

	static struct pt_timer	timer_gsm_power;
	static uint8_t			at_init_index	= 0;
	static uint8_t			at_init_retry	= 0;
	rt_err_t				ret;

	PT_BEGIN( pt );
	if( gsm_state == GSM_POWERON )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );

		pt_timer_set( &timer_gsm_power, 200 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );

		GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );

		pt_timer_set( &timer_gsm_power, 200 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );

		//GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );

		//GPIO_ResetBits(GPIOD,GPIO_Pin_9); /*开功放*/

		for( at_init_index = 0; at_init_index < sizeof( at_init ) / sizeof( AT_CMD_RESP ); at_init_index++ )
		{
			for( at_init_retry = 0; at_init_retry < at_init[at_init_index].retry; at_init_retry++ )
			{
				pt_timer_set( &timer_gsm_power, 50 );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );

				if( at_init[at_init_index].atcmd != RT_NULL )
				{
					dev_gsm_write( &dev_gsm, 0, at_init[at_init_index].atcmd, strlen( at_init[at_init_index].atcmd ) );
					rt_kprintf( "%d gsm_send>%s", rt_tick_get( ), at_init[at_init_index].atcmd );
				}
				pt_timer_set( &timer_gsm_power, at_init[at_init_index].timeout );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( at_init[at_init_index].resp ) ) );
				if( pt_timer_expired( &timer_gsm_power ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
				}else
				{
					break;
				}
			}
			if( pt_timer_expired( &timer_gsm_power ) )  /*因为超时退出的*/
			{
				PT_EXIT( pt );
			}
		}
		//GPIO_SetBits(GPIOD,GPIO_Pin_9); /*关功放*/
		gsm_state = GSM_AT;                             /*切换到AT状态*/
	}
	if( gsm_state == GSM_AT )                           /*定时查CSQ*/
	{
		dev_gsm_write( &dev_gsm, 0, "AT+CSQ\r\n", 8 );
		rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), "AT+CSQ\r\n" );
		pt_timer_set( &timer_gsm_power, RT_TICK_PER_SECOND * 3 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( pt_resp_CSQ ) ) );
		if( pt_timer_expired( &timer_gsm_power ) )      /*超时*/
		{
			rt_kprintf( "\r\nAT+CSQ timeout\r\n" );
		}
		pt_timer_set( &timer_gsm_power, RT_TICK_PER_SECOND * 3 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );
	}
	if( gsm_state == GSM_POWEROFF )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		gsm_state = GSM_IDLE;
	}
	PT_END( pt );
}

#endif

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[1024];
struct rt_thread thread_gsm;


/***********************************************************
* Function:       rt_thread_entry_gsm
* Description:    接收处理，状态转换
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	ch;
	char			*ptts;

